# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Construction..::..Name Property
Construction Class See Also
---
Get the name of the Construction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# Remarks
This property is used to get the name of the Construction.
# See Also
Construction Class
Autodesk.Revit.DB Namespace